Тестовая_база_ERP_14/src/Enums/сшпСтатусыСообщений/сшпСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>сшпСтатусыСообщений</name>
  <comment>Основные статусы сообщений</comment>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработки</name>
  </enumValues>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуетОбработчик</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаОтменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтправки</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаОтменена</name>
  </enumValues>
  <enumValues>
    <name>НеВалидно</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаПодтверждена</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/сшпТипыОчередей/сшпТипыОчередей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>сшпТипыОчередей</name>
  <enumValues>
    <name>Входящая</name>
  </enumValues>
  <enumValues>
    <name>Исходящая</name>
  </enumValues>
  <enumValues>
    <name>Системная</name>
  </enumValues>
  <enumValues>
    <name>Отправки</name>
  </enumValues>
  <enumValues>
    <name>ОтправкиСистемныхСообщений</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/сшпСтатусыСообщений/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Не Параметры.Отбор.Свойство("Ссылка") Тогда 
		Возврат	
	КонецЕсли;
	
	Если Параметры.Отбор.Ссылка = Перечисления.сшпТипыОчередей.Системная
		ИЛИ Параметры.Отбор.Ссылка = Перечисления.сшпТипыОчередей.Исходящая 
		ИЛИ Параметры.Отбор.Ссылка = Перечисления.сшпТипыОчередей.Входящая 
	тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.сшпСтатусыСообщений.ОжиданиеОбработки);
		ДанныеВыбора.Добавить(Перечисления.сшпСтатусыСообщений.ОбработкаОтменена);
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Параметры.Отбор.Ссылка = Перечисления.сшпТипыОчередей.Отправки тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.сшпСтатусыСообщений.ОжиданиеОтправки);
		ДанныеВыбора.Добавить(Перечисления.сшпСтатусыСообщений.ОтправкаОтменена);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
